[
  {"content": "A guy walks into a bar and sees a jar of $100 bills on the counter\r\n\r\nHe asks the bartender \"Hey, what's with the jar?\"\r\n\r\nThe bartender replies \"Well, we have a running challenge here in the bar. It has three parts. If you look at the end there, you'll see Big Jim. Big Jim is the baddest motherfucker in town. You have to knock Big Jim out.\"\r\n\r\nThe guy looks down to see a 6'4 300lb guy and says \"Well, I don't think I can do that. What's the other two parts?\"\r\n\r\n\"After that, you have to go outside. Around back is where we keep Big Jim's dog. He's the baddest junkyard dog you've ever seen. You have to go get a tooth out of his mouth. And then, when you're done with that you have to go upstairs. There you'll find Big Jim's mom. She's 70 years old and never had an orgasm in her life. You've gotta go up there and fuck her to completion.\"\r\n\r\nThe man says \"Wow, I can see why the jar is so full.\"\r\n\r\nAfter a few hours of drinking the man get sloppy drunk and says \"Fuck it,\" slaps down a $100 and jumps up on the bar and runs down and kicks Big Jim square in the jaw knocking him out cold. The bartender is stunned, as this is the furthest anyone has made it. The man runs outside to the cheers of the patrons and everyone hears snarling and growling and grows silent. Moments later they hear the dog whimper and then yelp, then nothing.\r\n\r\nMoments later the man drunkenly stumbles back in and says \"Alright, now where's the old lady with the tooth?\""},
  {"content": "A gorilla goes into a bar and orders a martini. \r\n\r\nThis totally amazes the bartender, but he thinks, \"What the heck, I guess I might as well make the drink.\" So he mixes the martini. He then walks back over to the give it to the gorilla, and the animal is holding out a twenty-dollar bill. \r\n\r\nWell, now the bartender is just at a loss for words. He can't believe that a gorilla walked into his bar, ordered a martini, and then actually had a twenty-dollar bill to pay for it.\r\n\r\nSo, in amazement, he takes the twenty and walks to the cash register to make the change. While he's standing in front of the cash register he stops for a second and thinks to himself, \"Let me try something here and see if the gorilla notices anything.\"\r\n\r\nSo he walks back over to the gorilla and hands him a dollar change. The gorilla doesn't say anything, he just sits there sipping the martini. After a few minutes the bartender just can't take it anymore.\r\n\r\n\"You know,\" he says to the gorilla, \"we don't get too many gorillas in here.\"\r\n\r\nAnd the gorilla says, \"At nineteen dollars a drink I'm not surprised.\""},
  {"content": "A guy walks into a bar owned by Eminem\r\n\r\nHe tells the bartender,\"Give me 2 shots of...\"\r\n\r\nThe bartender cuts him off saying,\"You only get 1 shot.\""},
  {"content": "A cowboy walks into a bar and takes a seat next to a very attractive woman.\r\n\r\nHe gives her a quick glance then causally looks at his watch for a moment.\r\n\r\nThe woman notices this and asks, \"Is your date running late?\"\r\n\r\n\"No\", he replies, \"I just got this state-of the-art watch, and I was just testing it.\"\r\n\r\nThe intrigued woman says, \"A state-of-the-art watch? What's so special about it?\"\r\n\r\nThe cowboy explains, \"It uses alpha waves to talk to me telepathically.\"\r\n\r\nThe lady says, \"What's it telling you now?\"\r\n\r\n\"Well, it says you're not wearing any panties.\"\r\n\r\nThe woman giggles and replies, \"Well it must be broken because I am wearing panties!\"\r\n\r\nThe cowboy smiles, taps his watch and says, \"Damn thing's an hour fast.\""},
  {"content": "Scotsman, Englishman, and an Irishman walk into a bar.\r\n\r\nThe Scotsman says, \"As good as this bar is, I still prefer the pubs back home. In Glasgow, there's a wee place. The landlord goes out of his way for the locals. When you buy four drinks, he'll buy the fifth drink.\"\r\n\r\n\"Well,\" said the Englishman, \"At my local in London , the barman will buy you your third drink after you buy the first two.\"\r\n\r\n\"Ahhh, dat's nothin',\" said the Irishman, \"back home in my favorite pub, the moment you set foot in the place, they'll buy you a drink, then another, all the drinks you like, actually. Then, when you've had enough drinks, they'll take you upstairs and see that you gets laid, all on the house!\"\r\n\r\nThe Englishman and Scotsman were suspicious of the claims. The Irishman swore every word was true. Then the Englishman asked, \"Did this actually happen to you?\" \"Not to me, personally, no,\" admitted the Irishman, \"but it did happen to me sister quite a few times.\""},
  {"content": "Asian guy walks into a bar\r\n\r\nHe sits down at the the bar and start drinking a beer. \r\n\r\nThe guy next to him ask: you know kung fu or karate or any or this shit?\r\n\r\nThe asian guy replies: why you ask this, is because I chinese? The other guy replies no it’s because you’re drinking my fucking beer."},
  {"content": "A 13 year old weasel walks into a bar and approaches the counter. The bartender immediately notices the underage weasel.\r\n\r\n\"Sir, you look extremely young. I can't serve you even a single beer.\"\r\n\r\n\"Oh c'mon. You can't just slide me one?\"\r\n\r\n\"Can't and will not serve to anyone under age.\"\r\n\r\n\"Fine. Well what other things do you have?\"\r\n\r\n\"Well for non-alcoholics I have tap water and bottled water, I have coffee, and I have pop. Which would you like?\"\r\n\r\n\"Pop.\" Goes the weasel."},
  {"content": "A guy walks into a crowded local bar, holding a pistol in his hand and yelling, “I have a 45 caliber pistol here with seven rounds in the barrel plus one in the chamber and I want to know who’s been sleeping with my wife.”\r\n\r\nA voice from the other end of the bar called out, “You’ll need more ammo”"},
  {"content": "A man walks into a bar and sees two pieces of meat hanging from the ceiling.\r\n\r\nConfused, he asks the bartender \"why do you have meat hanging from your ceiling?\" \r\n\r\nThe bartender says \"I'm glad you asked, currently we have a challenge going on where if you can jump up and slap both pieces of meat with your hands I'll cover your tab for the whole rest of the night. However, if you attempt to slap the meat and miss, you have to pay for everyone else's drinks in the bar until we close\". \r\n\r\nThe bartender looks back at the customer and asks \"So what do you say, would you like to give the challenge a shot?\" \r\n\r\nThe customer quickly responds with a \"No\". \"Why not?\" The bartender asks. The customer replies, \"The stakes are too high\"."},
  {"content": "A white man, a black man and an orange man walk into the bar.\r\n\r\nThe white man goes up to the bar to order a whiskey.\r\n\r\nThe barman goes, \"Hey, aren't you George Bush?\" \r\n\r\n\"Yes, I am\" he replies. \r\n\r\n\"Well Mr. President it's an honor.\" \r\n\r\nThen the black man goes up to the bar to get his drink. \r\n\r\n\"Hey, aren't you Barack Obama?\" asks the barman.\r\n\r\n\"Yes I am\", Obama responds. \r\n\r\n\"Two presidents in my bar in one day; this is the highlight of my life\" the barman gushes.\r\n\r\nThen the orange man walks up to the bar. The barman immediately tells him to get out of the bar. Furiously, he asks why and the barman exclaims \"Ted; you just got a new liver last week. Your wife would kill me if I gave you a drink.\""},
  {"content": "A man walks into a bar and orders a beer.\r\n\r\nAfter having the beer, he asks the bartender for the bill.\r\n\r\n\"$3\", says the bartender.\r\n\r\nThe man just for fun goes on and places a $1 coin on the three ends of the table. The bartender gives him a bad look but has no other option but to pick them up.\r\n\r\nThis happened for 3-4 days and everyday the bartender felt humiliated.\r\n\r\nThe next day, he orders a beer but couldn't find three $1 coins to pay the bill. So, he hands the bartender a $5 note. Now, the bartender gets all excited and thinks that it is his day to avenge the hard time he had because of this man. He then places the two $1 coins at the opposite ends of the table.\r\n\r\nNow, with a shrewd smile and with all the excitement he goes to the man and says, \"Go on, collect your change\".\r\n\r\nThe man then takes out a $1 coin from his pocket and puts it in front of the bartender and says, \"One more beer please.\""},
  {"content": "An infinite number of people walk into a bar.\r\n\r\nThe first orders a beer. The second orders half a beer. The third orders a quarter beer. The fourth orders an eighth of a beer...\r\n\r\nThe bartender pulls out two beers and tells them to know their limits."},
  {"content": "A Priest, Rabbi and Atheist walk into a bar and each ask for a drink\r\n\r\nThe bartender, saying nothing and looking disdainful, points to a sign clearly labelled: NO JOKES SERVED HERE\r\n\r\nWithout a fight the Priest, Rabbi and Atheist leave the bar, heads hanging.\r\n\r\nThe next day a chicken walks in and plops down on the barstool.\r\n\r\nWiping the inside of a glass, the bartender approaches and asks the chicken “Are you part of this joke?”\r\n\r\n“Yeah.” the chicken replies.\r\n\r\nAgain, he points to the sign: NO JOKES SERVED HERE\r\n\r\nThe chicken argues “Well then how’s a chicken supposed to get his beak wet?”\r\n\r\nThe bartender moves his pointed finger from the sign to the window.\r\n\r\n“There’s another bar across the road.”"},
  {"content": "A man and his family walk into a bar.\r\n\r\nInside of the bar, the man's youngest child sees a Native American sitting under a sign stating \"World's longest memory\". The child walks up to sign and decides to test if this sign is true. The child asks \"What did you have for breakfast 30 years ago?\" The Native American states \"eggs.\" \r\n\r\nThe child states that the native could have just made that up, and then later leaves the bar.\r\n\r\nYears later, when the child returns back with his own family he sees the same native at the bar. Walking up to the man, he states a stereotypical \"how!\" The Native replies \"scrambled.\""},
  {"content": "A blind man walks into a bar\r\n\r\nThe bartender says \"Oh hey! I haven't seen you in forever!\" The blind man says \"same\""},
  {"content": "A man walks into a bar and orders nine shots of jaegermeister.\r\n\r\n\"Why are you ordering so many?\" asks the barman?\r\n\r\n\"I just had my first blowjob\" says the man.\r\n\r\n\"Well shit, congratulations, have a tenth one on me!\"\r\n\r\n\"Thanks, but if nine doesn't get rid of the taste, nothing will\"."},
  {"content": "A guy walks into a bar and takes a seat.\r\n\r\nBefore he can order a beer, the bowl of pretzels in front of him says \"Hey, you're a handsome fellow.\" \r\n\r\nThe man tries to ignore the bowl of pretzels, and orders a fine Pilsner beer. \r\n\r\nThe bowl of pretzels then says \"Ooooh, a pilsner, great choice. You're a smart man.\"\r\n\r\nStarting to freak out, the guy says to the bartender \"Hey what the hell, this bowl of pretzels keeps saying nice things to me!\" \r\n\r\nBartender says \"Don't worry about it, the pretzels are complimentary.\"\r\n\r\n"},
  {"content": "A cat walks into a bar.\r\n\r\nThe bartender says, \"what'll you have?\" \r\n\r\nThe cat says, \"A shot of rum.\" \r\n\r\nThe bartender pours the cat his drink. \r\n\r\nThe cat slowly pushes the shot off the table. \"Another.\""},
  {"content": "A Guy Walks Into A Bar With An Octopus Under His Arm\r\n\r\nHe sets the octopus on a stool next to him and announces: \"This is an amazing octopus. I'll bet anyone in this bar $50 that this octopus can play any instrument set in front of it.\"\r\n\r\nNone of the people could believe this, so one guy brought up a guitar. The octopus took hold of the guitar and started picking away, better than Jimi Hendrix. The man took $50 from the guitarist. Next someone brings up a trumpet. The octopus started playing the trumpet, better than Herb Alpert. The man won another $50 from the trumpeter. Then some guy brought up some bagpipes. The octopus picked up the bagpipes for a minute and, looking a little puzzled, set them down again.\r\n\r\n\"Can't you play the bagpipes?\" asked the man. \"Play it?\" said the octopus, \"I'm gonna screw it as soon as I figure out how to get its pajamas off.\""},
  {"content": "Two scientists walk into a bar.\r\n\r\n\"I'll have H2O,\" says the first.\r\n\r\n\"I'll have H2O, too,\" says the second.\r\n\r\nThe bartender gives them both water because he is able to distinguish the boundary tones that dictate the grammatical function of homonyms in coda position, as well as pragmatic context.\r\n\r\n"},
  {"content": "A man walks into a bar.\r\n\r\nA man walks into a bar and he is completely parched. He sits at the bar, pats his pockets and realises he's left his wallet at home. He calls to the bartender,\r\n\r\n\"Hey pal, I've left my wallet at home but hey... tell you what, if I can show you something incredible, will you give me a free beer in return?\"\r\n\r\nThe bartender is a worldly individual. \"Listen mate, look around at the stuff on the walls, I've seen all kinds of things, been all kinds of places. I mean, you can give it a shot but I honestly doubt you can show me something that impressive.\"\r\n\r\nSo the man reaches into his left jacket pocket and pulls out a small hamster. He places the hamster on the bar and the bartender looks bemused. The man reaches into his other jacket pocket and pulls out a tiny piano, followed by a tiny stool, just the right size for the hamster, who sits down, cracks his knuckles and starts playing a famous piece of music by Rachmaninoff.\r\n\r\nThe bartender is speechless.\r\n\r\n\"Tell you what mate... I've seen some things in my time but that is absolutely incredible! Here's your free beer.\"\r\n\r\nThe visitor gulps down his drink until the last drop is gone. But he can't help but feel another drink would really hit the spot. He motions to the bartender again.\r\n\r\n\"Look, I could really use another drink - how about I show you something even more incredible?\"\r\n\r\nThe bartender stares in disbelief. \"After that performance, I think you'll struggle to beat it! But go on, try your luck then.\"\r\n\r\nThe man reaches into his left jacket pocket again and retrieves a small frog, who is wearing a waist coat. He places the frog on the stool beside the hamster. The hamster counts to four, the frog clears his throat, and over the piano the frog sings a classic opera, bringing several people in the bar to tears.\r\n\r\n\"Oh my word,\" says the bartender. \"That is absolutely unbelievable. Here's your pint, mate. You've earned it.\"\r\n\r\nIn the corner of the room, a shady looking individual has been watching with keen interest from behind his dark sunglasses. He approaches the owner of the performing animals and gets straight to business.\r\n\r\n\"I'll give you £50,000 right now, in cash, if you'll let me take that frog off your hands this instant.\"\r\n\r\n\"Well, sure, why not?\" says the man, as he duly hands the frog over to the shady character, who promptly slides back a silver briefcase filled with bank notes before making his exit with the frog.\r\n\r\n\"Are you MAD!?\" the bartender says to the man. \"You could have made millions with that frog!\"\r\n\r\n\"Nah,\" says the man.\r\n\r\n\"The hamster's a ventriloquist.\""},
  {"content": "So a guy walks into a bar and orders a pint of less.\r\n\r\nThe bartender asks, \"What's less?\" \r\n\r\nThe guy says \"I don't know but the doctor told me I have to start drinking it.\"\r\n\r\n"}
]