[
 {"content" : "The leader says, \"We are all here today to prove to the world that blondes are not stupid. Can I have a volunteer?\"\r\n\r\nA blonde gingerly works her way through the crowd and steps up to the stage.\r\n\r\nThe leader asks her, \"What is 15 plus 15?\"\r\n\r\nAfter 15 or 20 seconds she says, \"Eighteen!\"\r\n\r\nObviously everyone is a little disappointed. Then 80,000 blondes start cheering, \"Give her another chance! Give her another chance!\"\r\n\r\nThe leader says, \"Well since we\'ve gone to the trouble of getting 80,000 of you in one place and we have the world- wide press and global broadcast media here, gee, uh, I guess we can give her another chance.\"\r\n\r\nSo he asks, \"What is 5 plus 5?\"\r\n\r\nAfter nearly 30 seconds she eventually says, \"Ninety?\"\r\n\r\nThe leader is quite perplexed, looks down and just lets out a dejected sigh -- everyone is disheartened - the blonde starts crying and the 80,000 girls begin to yell and wave their hands shouting, \"GIVE HER ANOTHER CHANCE! GIVE HER ANOTHER CHANCE!\"\r\n\r\nThe leader, unsure whether or not he is doing more harm than good, eventually says, \"Ok! Ok! Just one more chance -- What is 2 plus 2?\"\r\n\r\nThe girl closes her eyes, and after a whole minute eventually says, \"Four?\"\r\n\r\nThroughout the stadium pandemonium breaks out as all 80,000 girls jump to their feet, wave their arms, stomp their feet and scream... \"Give her another chance! Give her another chance!\""},
 {"content": "Bob walked into his favorite sports bar around 9:58 PM. He sat down next to a blonde at the bar and stared up at the TV.\r\n\r\nThe 10 PM news was coming on. The news crew was covering the story of a man on the ledge of a large building preparing to jump. The blonde looked at Bob and said, \"Do you think he'll jump?\"\r\n\r\nBob said, \"You know, I bet he'll jump.\"\r\n\r\nThe blonde replied, \"Well, I bet he won't.\"\r\n\r\nBob placed a $20 bill on the bar and said, \"You're on!\"\r\n\r\nJust as the blonde placed her money on the bar the guy on the ledge did a swan dive off the building, falling to his death. The blonde was very upset, but willingly handed her $20 to Bob. \"Fair's fair.” she said, “Here's your money.\"\r\n\r\nBob replied, \"I can't take your money. I saw this earlier on the 5 PM news, so I knew he would jump.\"\r\n\r\nThe blonde replied, \"I did, too, but I didn't think he'd do it again.\""},
 {"content": "Two blondes are walking and one asks, “ which is closer, the moon or Florida?” And the other responds, “duh... can you see Florida?”"},
 {"content": "A blonde and her husband are watching the news...\r\n\r\nNews: A Brazilian man died while skydiving when his parachute didn’t open.\r\n\r\nThe blonde bursts into tears\r\n\r\nHusband (comforting her): I know it’s sad, but people need to know that there’s a risk while skydiving.\r\n\r\nBlonde: But that’s a lot of people. How many is a Brazilian?"},
 {"content": "A flight is on its way to Sydney when a blonde in economy class gets up, and moves to the first class section and sits down.\r\n\r\nThe flight attendant watches her do this, and asks to see her ticket.\r\n\r\nShe then tells the blonde that she paid for economy class, and that she will have to sit in the back.\r\n\r\nThe blonde replies, “I’m blonde, I’m beautiful, I’m going to Sydney and I’m staying right here”.\r\n\r\nThe flight attendant goes into the cockpit and tells the pilot and the co-pilot that there is a blonde bimbo sitting in first class, that belongs in economy, and won’t move back to her seat.\r\n\r\nThe co-pilot goes back to the blonde and tries to explain that because she only paid for economy she will have to leave and return to her seat.\r\n\r\nThe blonde replies, “I’m blonde, I’m beautiful, I’m going to Sydney and I’m staying right here”.\r\n\r\nThe co-pilot tells the pilot that he probably should have the police waiting when they land to arrest this blonde woman who won’t listen to reason.\r\n\r\nThe pilot says, “You say she is a blonde? I’ll handle this, I’m married to a blonde. I speak blonde”.\r\n\r\nHe goes back to the blonde and whispers in her ear, and she says, “Oh, I’m sorry” and gets up and goes back to her seat in economy.\r\n\r\nThe flight attendant and co-pilot are amazed and asked him what he said to make her move without any fuss.\r\n\r\nI told her, “First class isn’t going to Sydney “\r\n"},
 {"content": "Blonde gets caught speeding.\r\n\r\nCop: “Let me see your driver’s license.”\r\n\r\nDriver: “What’s that?”\r\n\r\nCop: “A square thing with your picture on it.”\r\n\r\nBlonde fumbles through her purse, finds a mirror, sees herself in it, and hands it to the cop.\r\n\r\nCop looks at it, hands it back and says,\r\n\r\n“I’m gonna let you go without a ticket. I didn’t know you were a cop.”"},
 {"content": "A blonde goes to work in tears. \r\n\r\nHer boss asks, \"What's wrong?\"\r\n\r\nShe says, \"My mom died.\"\r\n\r\nHe told her to go home, but she said, \"No, I'll be fine.\" \r\n\r\nLater that day, her boss finds her crying again. He says, \"What's wrong?\" \r\n\r\nShe replies, \"I just talked to my sister, and her mom died, too!\""},
 {"content": "Blonde guy gets home from work...\r\n\r\nHears his wife screaming, coming from their bedroom upstairs. He sprints up, and opens the door to see his wife laying naked on their bed, sweating and panting.\r\n\r\n\"Honey! Help! I'm having a heart attack!\"\r\n\r\nHe runs back down the stairs and starts dialing the ambulance, when his son and daughter tell him:\r\n\r\n\"Dad! Uncle Terry's upstairs! And he's naked!\"\r\n\r\nHe slams down the phone, sprints back up the stairs, runs past his wife and opens the wardrobe. Sure enough, there was his brother crouching in the corner naked.\r\n\r\n\"WHAT THE HELL TERRY! My wife's having a heart attack and you're running around naked scaring the kids!\""},
 {"content": "A blonde was desperate for money.\r\n\r\nso she decided to go to the richer neighborhoods around town and look for odd jobs.\r\n\r\nAt the first house, a man answered the door and told her. 'Yeah, I have a job for you. Could you paint the porch?'\r\n\r\n'Sure,' smiled the blonde, 'I'll do it for $100.'\r\n\r\n'Great,' the man replied. 'You'll find the paint and stuff you need in the garage.'\r\n\r\nThe man went back into the house to his wife, who'd been listening. 'A hundred bucks! Does she know it goes all the way around the house?' asked the wife.\r\n\r\n'Well, she must. She was standing right on it!' he said.\r\n\r\nAbout 45 minutes later, the blonde knocked on the door. 'I'm all done,' she reported.\r\n\r\nThe man was amazed. You painted the whole porch?'\r\n\r\n'Yeah,' the blonde said. 'I even had some left, so I put on two coats!'\r\n\r\nThe man reached into his wallet to pay her.\r\n\r\n'And by the way,' said the blonde, 'that's not a Porsche. It's a Ferrari.'"},
 {"content": "A blonde, brunette, and redhead mom go to a cafe\r\n\r\nThey had each stolen their daughters purses to see what their girls did in their free time.\r\n\r\nThe redhead mom opens her daughters purse first and finds a pack of cigarettes. “Oh my God, Debbie smokes! I am going to kill her!”\r\n\r\nThe brunette mom opens her daughter’s purse second, holding up a half-smoked joint. “Lindsay smokes pot?! How could she?!”\r\n\r\nThe blonde mom rifles through her daughter’s purse next and pulls out an empty condom wrapper. The other moms stare at her for a few moments before she puts her hand over her mouth. “Holy shit... Cindy has a dick.”"},
 {"content": "A readhead tells her blonde step-sister \"I slept with 2 Brazilian guys last night!\"\r\n\r\nThe blonde replies, \"Holy shit, you slut! How many is a Brazilian?\""},
 {"content": "Four people are sitting in the passenger car of a train. A hot blonde, a nun, a brit and a french guy. \r\n\r\nThe train goes into a tunnel, there's total darkness for a brief moment, and all you can hear is a loud slap. \r\n\r\nAs the train is leaving the tunnel, sunlight lights the scene up, and a confused french is holding his burning red cheek and looking around. \r\n\r\nThe nun is thinking to herself \"This scumbag probably tried to touch the blonde and she slapped him.\" \r\n\r\nThe blonde is thinking \"That scumbag was probably trying to touch me, touched the nun by accident and she slapped him.\" \r\n\r\nThe french guy is thinking \"I bet the brit was trying to touch one of them, they thought it was me and slapped me!\" \r\n\r\nThe brit is thinking \"Next tunnel, I'm gonna slap him even harder.\""},
 {"content": "A girl came skipping home from school one day. \"Mommy, Mommy,\" she yelled, \"we were counting today, and all the other kids could only count to four, but I counted to 10. See? 1, 2, 3, 4, 5, 6, 7, 8, 9, 10!\" \r\n\r\n\"Very good,\" said her mother. \r\n\r\n\"Is it because I'm blonde?\" the girl said. \r\n\r\n\"Yes, it's because you're blonde,\" said the mommy. \r\n\r\nThe next day the girl came skipping home from school. \"Mommy, Mommy\" she yelled, \"we were saying the alphabet today, and all the other kids could only say it to G, but I said it to N. See? A, B, C, D, E, F, G, H, I, J, K, L M, N!\" \r\n\r\n\"Very good,\" said her mother. \r\n\r\n\"Is it because I'm blonde, Mommy?\" \r\n\r\n\"Yes, it's because you're blonde.\" \r\n\r\nThe next day the girl came skipping home from school. \"Mommy, Mommy,\" she yelled, \"we were in gym class today, and when we showered, all the other girls had flat chests, but I have these!\" She lifted her tank top to reveal a fully developed chest. \r\n\r\n\"Very good,\" said her embarrassed mother. \r\n\r\n\"Is it because I'm blonde, mommy?\" \r\n\r\n\"No Honey, it's because you're 19!\\"},
 {"content": "An Italian, a Mexican, and a Blonde American are working construction.\r\n\r\nThe three men eat lunch together each day at the top of the building they are constructing.\r\n\r\nThe Italian opens his lunchbox and exclaims \"Seriously!? Spaghetti again? If my wife packs this one more time, I swear I'm jumping off this building.\"\r\n\r\nThe Mexican opens his too. \"Tacos again? I'm with you. I'm jumping tomorrow if it happens again.\"\r\n\r\nThe blonde opens up his lunch box and pulls out a PB&J sandwich. \"Another PB&J!\" He cries. \"I'm jumping tomorrow too if I get a PB&J in my lunch again.\"\r\n\r\nThe next day, the Italian opens his lunch, pulls out a tupperware of spaghetti, and jumps to his death. The Mexican pulls out a bag of tacos, and immediately follows the Italian off of the building. The Blonde pulls out a PB&J, sighs, and jumps to his death as well.\r\n\r\nA few days later at the funeral, the Italian and Mexican's wives are in tears. Both exclaim that if they had known, they would have packed something different and the men would still be alive. The women notice the wife of the Blonde, standing there and not shedding a tear.\r\n\r\nThey ask the wife of the Blonde \"How can you not be upset? Your husband is dead because he kept getting the same food!\"\r\n\r\nThe wife of the blonde replies \"Don't look at me. He packed his own lunch.\""},
 {"content": "A blonde, a brunette, and a redhead are stuck on an island\r\n\r\nThe redhead tries to swim back to land, gets a quarter of the way there, gets tired, and swims back.\r\n\r\nThe brunette decides to try, swims a third of the way there, gets tired, and swims back.\r\n\r\nFinally the blonde tries, swims half of the way there, gets tired, swims back."},
 {"content": "A blonde is on the bus when this guy gets on with both of his front trouser pockets full of golf balls and sits down next to her. \r\n\r\nThe confused blonde keeps looking at him and his bulging pockets.\r\n\r\nHe notices her looking and eventually, after many such glances from her, he says, “It’s golf balls.”\r\n\r\nNevertheless, the blonde continues to look at him for a very long time, appearing to think deeply about what he had said.\r\n\r\nAfter several minutes, she can’t contain her curiosity any more and asks, “Does it hurt as much as tennis elbow?”"},
 {"content": "A blonde, a brunette, and a redhead decide to rob a bank. Everything goes well-they have their masks on, the bank hands over the money-awesome.\r\n\r\nExiting the bank, they hear sirens and see several cop cars round the corner, so they dash into a small alleyway.\r\n\r\nThe cops are quick though, and are just about to reach the entrance. There are three empty potato sacks lying against the wall.\r\n\r\n\"Quick! Hide!\" The brunette says, and the three women each crawl into a bag.\r\n\r\nA police man comes down the alleyway, looking around for any signs of the women. The potato sacks stick out to him-so he gives the one with the redhead a kick.\r\n\r\n\"Meow!\" goes the redhead, doing her best imitation of a cat.\r\n\r\n\"Just an alley cat...\" The police officer mumbles, moving onto the next bag and delivering a quick nudge with his foot.\r\n\r\n\"Woof!\" Goes the brunette, imitating a dog.\r\n\r\n\"Just a stray...\" The officer mumbles again, heading to the last bag, and giving it a light kick.\r\n\r\n\"POOOOE-TAYYY-TOOOEE\" grunts the blonde."},
 {"content": "A blonde walked into a shoe shop and saw a pair of shoes made from alligator skin that she liked.\r\n\r\n“How much for these shoes?” – she asked the store manager.\r\n\r\n“$300” – he replied.\r\n\r\n“That’s too expensive! Can’t you bring the price down?” – the blonde.\r\n\r\nThe store manager said he couldn’t,and got irritated when the blonde persisted.\r\n\r\nFinally, after arguing with her for awhile he said, \"There's a pond with alligators behind the store! Why don't you kill an alligator and get your alligator shoes free?!\" – he yelled.\r\n\r\n“Fine. I will.” – the blonde replied.\r\n\r\nAfter two hours, the manager got a bit worried that the blonde might have come to harm with the alligators. He decided to go out and check on her.\r\n\r\nWhen he arrived at the pond, he saw the blonde lugging a dead alligator and flinging it on the ground next to 7 other dead ones.\r\n\r\nBefore he could ask what she was doing, she wailed “Oh my gosh! This one doesn’t have any shoes either!”"},
 {"content": "\r\nA blonde girl wants to know what life is like as a brunette girl, so she goes to the hairdresser and has her hair died brown.\r\n\r\nEager to show the world her newly acquired intelligence, she goes on a walk and meets a shepherd. She walks towards him and says:\r\n\r\n\"if i can guess how many sheep you have in your pack, can I have one?\"\r\n\r\n\"fair deal\" the shepherd says and the blonde guesses \"457\". The shepherd, really surprised about the ability of the girl, says \"a deal is a deal, you guessed the right number, pick a sheep and you can keep it\".\r\n\r\nAfter the girl has picked her favourite of the pack, the shepherd says:\r\n\r\n\"if i can guess, which colour your hair had before you dyed it brown, can i get my dog back?\""},
 {"content": "A blonde walked into a gas station and told the manager, \"I locked my keys in my car and I was wondering if you had a coat hanger I could stick through the window and unlock the door.\"\r\n\r\n\"Why, sure,\" said the manager, \"We have something that works especially for that.\"\r\n\r\nA couple minutes later, the manager walked outside to see how the blonde was doing. He heard another voice. \"No, no, a little to the left,\" said the other blonde inside the car."},
 {"content": "A blonde mom is cooking dinner when her blonde daughter walks in.\r\n\r\nThe daughter asks, \"Mom, why do people think we blondes are stupid?\"\r\n\r\nHer mother replies, \"I'll show you\", and taps hard on the kitchen counter.\r\n\r\nSomewhat confused, the blonde daughter says, \"Someone's at the door!\".\r\n\r\nThe blonde mother laughs. \"This is why people think we're stupid. Now watch over the stove for me while I answer the door.\""},
 {"content": "3 blonde women are on one side of a river wondering how they will get across. \r\n\r\nThe first one decides to pray saying \"God please make me smart enough to get across this river.\" so God turns her into a brunette and she swims across the river. \r\n\r\nThe second also prays saying \"Dear God, please make me twice as smart as the last girl so I can get across this river.\" So God turns her into a red head and she builds a boat and rows across the river.\r\n\r\nThe third also prays \"Dear God, please make me twice as smart as both of those women combined.\" So God turns her into a man and she walks across the bridge.\r\n\r\n"}
]