[
  {"content" : "My son was just born(!) and another dad at the nursery congratulated me and said his daughter was born yesterday… said maybe they'll marry eachother.\r\n\r\nSure, like my son is going to marry someone twice his age..."},
  {"content" : "My wife accused me of hating her family and relatives.\r\n\r\nI replied, \"No, I don't hate your relatives. In fact, I like your mother-in-law a lot better than I like mine.\""},
  {"content" : "I got an e-mail saying, \"At Google Earth, we can read maps backwards!\" and I thought.\r\n\r\n“That’s just spam.”"},
  {"content" : "My girlfriend is turning 32 soon.\r\n\r\nI've told her not to get her hopes up. \"After all,\" I say, \"we're only going to be celebrating it for half a minute.\" When she asked what in the world I was talking about, I pointed out, \"This is your thirty-second birthday.\""},
  {"content" : "Today, my son asked \"Can I have a book mark?\" and I burst into tears.\r\n\r\n11 years old and he still doesn't know my name is Brian."},
  {"content" : "My daughter screeched, \"Daaaaaad, you haven't listened to one word I've said, have you!?\"\r\n\r\nWhat a strange way to start a conversation with me..."},
  {"content" : "If you rearrange the letters of “Postmen”\r\n\r\nThey get really pissed off."},
  {"content" : "A guy walks into the bank, pulls out a gun, points it at the teller and screams, “Give me all your money or you’re geography!”\r\n\r\nThe teller replies, “Don’t you mean history?”\r\n\r\nThe robber says, “Don’t change the subject!\""},
  {"content" : "I told my son I was named after Thomas Jefferson\r\n\r\nHe said, “But dad, your name is Brian.”\r\n\r\nI said, “I know, but I was named AFTER Thomas Jefferson.”"},
  {"content" : "I hate those people who knock on your door and tell you you need to get \"saved\" or you'll \"burn\"..\r\n\r\nStupid firemen."},
  {"content" : "We were eating dinner tonight, when my daughter said to me, “I see your glass is empty. Would you like another one?”\r\n\r\nI said, “Why would I want two empty glasses?”"},
  {"content" : "My wife caught me standing on the bathroom scale, sucking in my stomach\r\n\r\n“Ha­­! That’s not going to help,” she said.\r\n\r\n“Sure, it does,” I said. “It’s the only way I can see the numbers.”"},
  {"content" : "A man is washing his car with his son. The son asks..\r\n\r\n\"Dad, can't you just use a sponge?\""},
  {"content" : "My wife said that I won’t advance in my career because I procrastinate too much.\r\n\r\nI said, “Oh yeah? Just you wait.”"},
  {"content" : "Daughter: \"Hey dad, how do you feel about abortion?\"\r\n\r\nFather: \"Ask your sister.”\r\n\r\nDaughter: \"I don't have a si-\""},
  {"content" : "“Hey Dad, have you seen my sunglasses?”\r\n\r\n“No son, have you seen my dad glasses?”"},
  {"content" : "Son: \"Mom, Dad, I'm gay.\"\r\n\r\nMom: Stares at Dad\r\n\r\nDad: Clenches fist\r\n\r\nMom: \"Don't!\"\r\n\r\nDad: Sweats Profusely\r\n\r\nMom: \"...\"\r\n\r\nDad: \"HI GAY, I'M DAD\""},
  {"content" : "A boy and his dad are talking.\r\n\r\n\"Hey Dad.\"\r\n\r\n\"Yes son?\"\r\n\r\n\"Did you ever get shot in the army?\"\r\n\r\nHe looks at his son in silence. Tears start to form in the Dad's eyes, and he quietly replies;\r\n\r\n\"No, but I was shot in the leggy.\""},
  {"content" : "Terrorist holding dad at gunpoint\r\n\r\nTerrorist: \"Say your last words!\"\r\n\r\nDad: \"Your last words!\"\r\n\r\nTerrorist: \"What? ugh, you Americans. Be serious!\"\r\n\r\nDad: \"Okay, I'll be Sirius. Who are you going to be?\"\r\n\r\nTerrorist: \"Stop. Why isn't this scaring your?\"\r\n\r\nDad: \"Nothing really scares me anymore; not since I saw that monster henway.\"\r\n\r\nTerrorist: \"What's a 'henway'\"?\r\n\r\nDad: \"About a pound and a half.\"\r\n\r\nTerrorist: \"Stop! I'm serious!\"\r\n\r\nDad: \"Hi Sirius! I'm Dad!\""},
  {"content" : "Dad: I'm giving all your toys to the orphanage\r\n\r\nKid: Why are you doing that? Dad: So you don't get bored there."},
  {"content" : "Dad: [grabs chest] Quick! Call me an ambulance.\r\n\r\nMe: [hesitantly] You're... an ambulance.\r\n\r\nDad: I'm- I'm so proud of you, son [dies]"}
]