[
  {"content": "A 17 year old male walks into a drug store. He says \"I've been invited to Christmas dinner at my new girlfriend's house. Afterwards I hope there is a chance I get lucky, you know what I mean\"\r\n\r\nClerk: \"How about condoms then? They could come in handy. Here's a pack.\" The young man after paying walks to the door, stops, smiles, comes back: \"you know what, the mom is also smoking hot, I think I'll take another pack, just in case I get extra lucky.\"\r\n\r\nChristmas eve comes around, the boy sits at the dinner table and doesn't say a word. After a while his girlfriend says: \"if I had known you were so quiet, I wouldn't have invited you.\" the young man replies \"if you had told me your dad works at a drug store, I wouldn't have come.\""},
  {"content": "A man is walking the Las Vegas strip, and runs into the most beautiful women he has ever met.\r\n\r\nHe starts talking to her, and to his luck he finds out she is a prostitute. So, he asks her.\r\n\r\n\"How much for a hand-job?\"\r\n\r\n\"5,000$\" she replies.\r\n\r\n\"5,000$?? You must be nuts, no way.\"\r\n\r\n\"Walk with me.\" She replies. He agrees and they walk for a moment to end up in front of a restaurant. \"You see this restaurant? I own this restaurant because men pay me 5,000$ for hand jobs.\"\r\n\r\nHe ponders for a moment. \"Damn, they must be pretty good then. Alright.\" He brings her back to his hotel room. Gets the hand job, and as advertised; it is the best hand job he has ever had. After he finishes, he realizes how perfect she is and asks. \"Okay, that was awesome. How much for a blow job?\"\r\n\r\n\"15,000$\" she replies.\r\n\r\n\"15,000$?!? You are out of your mind. No way!\" He shouts\r\n\r\n\"Come to the window.\" They walk to the window and she begins to point. \"You see those three casinos? I own those casinos because men pay me 15,000$ for blow jobs.\"\r\n\r\n\"Fine, how can i say no?\"\r\n\r\nOnce again, it is the best blow job of his life. He is writhing in ecstasy after finishing, and practically in love with this woman. \"Okay, I am gonna regret this. How much for the pussy?\"\r\n\r\n\"Come to the window.\" He follows her to the window, ready for anything. \"Do you see all of Las Vegas?\" She asks.\r\n\r\n\"No way! You own all of Las Vegas?!\" He exclaims, astounded.\r\n\r\n\"No..\" she looks down. \" But I would if I had a pussy...\""},
  {"content": "My girlfriend and I had sex a couple of days ago.\r\n\r\nShe looked at me and said, \"Turn the light off and stick it in my butt\".\r\n\r\nI guess I should have waited for the bulb to cool off first."},
  {"content": "A girl is having sex with her boyfriend\r\n\r\nAt her parents house. Her father after being woken by the noises goes upstairs to check it out, and walks in on them.\r\n\r\n\"Dad!\" she exclaimed in a panic \"... I'm sorry\"\r\n\r\nThe dad being a dad replies \"Hi Sorry! I'm Dad!\"\r\n\r\nHe then turns to the boyfriend and asks \"Are you fucking Sorry?\""},
  {"content": "A family walks into a hotel and the father goes to the front desk and says \"I hope the porn is disabled.\" \r\n\r\nThe guy at the desk replies. \"It's just regular porn you sick fuck.\""},
  {"content": "A highschool is having a talent show.\r\n\r\nThe first act is a girl trying to tie a knot with a cherry stem in her mouth. She tries and tries, but she just cant do it.\r\n\r\nA guy from the audience yells out, \"Hey, maybe you should practice with my dick!\" Most of the audience laughs.\r\n\r\nThe girl requests a microphone and a nearby teacher obliges. The girl says into the microphone, \"I think I should get good with the cherry stem before I try anything smaller.\""},
  {"content": "A man brings some flowers home to his wife. She's so surprised by his romantic gesture that she lays back on the dining table, throws her legs in the air and spreads them.\r\n\r\nHer husband confused looks down and goes \"What's that for?\"\r\n\r\nHis wife replies \"For the flowers of course\"\r\n\r\nHe thinks for a moment and asks \"Don't we have a vase?\""},
  {"content": "A teenage boy was delivering papers to an apartment house. While there, a stunning young woman came out of the apartment next to the mailboxes wearing only a robe. The boy smiled at the young woman and she started up a conversation with him. As they talked, her robe slipped open, and it was obvious that she had nothing else on. The poor kid broke into a sweat trying to maintain eye contact.\r\n\r\nAfter a few minutes of flirting, she placed her hand on his arm and said, \"Let's go to my apartment, I hear someone coming.\"\r\n\r\nHe followed her into her apartment; she closed the door and leaned against it, allowing her robe to fall off completely. Now nude, she purred at him, \"What would you say is my best feature?\"\r\n\r\nFlustered and embarrassed, he finally squeaked, \"It has to be your ears.\"\r\n\r\nAstounded, and a little hurt she asked, \"My ears? Look at these breasts; they are a full 38 inches and 100 percent natural. I work out every day and my ass is firm and solid. I have a 28 inch waist. Look at my skin, not a blemish anywhere. How can you think that the best part of my body is my ears?\"\r\n\r\nClearing his throat, he stammered, \"Outside, when you said you heard someone coming...that was me.\""},
  {"content": "A woman goes to the doctor, beaten Black and Blue.\r\n\r\nDoctor: \"What happened?\"\r\n\r\nWoman: \"Doctor, I don't know what to do. Every time my husband comes home drunk he beats me to a pulp.\"\r\n\r\nDoctor: \"I have a real good medicine for that. When your husband comes home drunk, just take a glass of sweet tea and start swishing it in your mouth. Just swish and swish but don't swallow until he goes to bed and is asleep.\"\r\n\r\nTwo weeks later the woman comes back to the doctor looking fresh and reborn.\r\n\r\nWoman: \"Doctor, that was a brilliant idea! Every time my husband came home drunk, I swished with sweet tea. I swished and swished, and he didn't touch me!\"\r\n\r\nDoctor: \"You see how much keeping your fucking mouth shut helps?\""},
  {"content": "A prostitute standing outside a motel in a small town saw a 70+ years old man walking past.\r\n\r\nShe hasn't had a customer for a while so she whistles at him and says, \"hey, would you like to have some fun time with me?\"\r\n\r\nThe old man said, \"but I won't be able to...\"\r\n\r\nProstitute: \"c'mon man.... give it a try... \"\r\n\r\nOld man says okay. They go in. The old man whips out his 8 incher and fucks the daylights out of her for 30 minutes.\r\n\r\nWhen he's done, the prostitute all exhausted and tired says, \"but you said you won't be able to....\"\r\n\r\n\"...pay you\" replied the old man."},
  {"content": "A guy goes to the whorehouse but he's strapped for cash.\r\n\r\n\"What can I get for 5 bucks?”\r\n\r\n\"5 bucks... That'll get you a 'penguin.' Rose! Come, take this man back and give him a penguin.\"\r\n\r\nRose takes the man to her room, undoes his pants and starts giving him a blowjob. But right before he is getting ready to come, she gets up and walks away.\r\n\r\nThe man becomes upset and, with his pants still around his ankles, waddles after her. \"Wait, so this is a penguin?!\""},
  {"content": "Johnny wanted to have sex with a girl in his office, But she belonged to someone else... \r\n\r\nOne day, Johnny got so frustrated that he went up to her and said, \"I'll give you a £100 if you let me have sex with you. But the girl said NO. Johnny said, \"I'll be fast. I'll throw the money on the floor, you bend down, and I'll be finished by the time you pick it up. \r\n\r\n\" She thought for a moment and said that she would have to consult her boyfriend... So she called her boyfriend and told him the story. Her boyfriend says, \"Ask him for £200, pick up the money very fast, he won't even be able to get his Pants down.\" So she agrees and accepts the proposal. \r\n\r\nHalf an hour goes by, and the boyfriend is waiting for his girlfriend to call. Finally, after 45 minutes, the boyfriend calls and asks what happened.\r\n\r\n...\r\n\r\nShe responded, \"The bastard used coins!\""},
  {"content": "One day, a young boy saw his grandpa smoking his cigarettes. The young boy asked, \"Grandpa, can I smoke some of your cigarettes?\" His grandpa replied, \"Can your penis reach your asshole?\" \"No\", said the boy. His grandpa replied, \"Then you're not old enough.\"\r\n\r\nThe next day, the boy saw his grandpa drinking beer. He asked, \"Grandpa, can I drink some of your beer?\" His grandpa replied, \"Can your penis reach your asshole?\" \"No\" said the boy. \"Then you're not old enough.\" his grandpa replied.\r\n\r\nThe next day, the boy was eating cookies. His grandpa asked, \"Can I have some of your cookies?\" The young boy replied, \"Can your penis reach your asshole?\" His grandpa replied, \"It most certainly can!\" the boy replied, \"Then go fuck yourself."},
  {"content": "A girl goes into a church one day to confess.\r\n\r\nGirl : \"Forgive me father for I have sinned.\"\r\n\r\nPriest : \"What have you done my child?\"\r\n\r\nGirl : \"I called a man a son of a bitch.\"\r\n\r\nPriest : \"Why did you call him a son of a bitch?\"\r\n\r\nGirl : \"Because he touched my hand.\"\r\n\r\nPriest : \"Like this?\" (as he touches her hand)\r\n\r\nGirl : \"Yes father.\"\r\n\r\nPriest : \"That's no reason to call a man a son of a bitch.\"\r\n\r\nGirl : \"Then he touched my breast.\"\r\n\r\nPriest : \"Like this?\" (as he touched her breast)\r\n\r\nGirl : \"Yes father.\"\r\n\r\nPriest : \"That's no reason to call him a son of a bitch.\"\r\n\r\nGirl : \"Then he took off my clothes, father.\"\r\n\r\nPriest : \"Like this?\" (as he takes off her clothes)\r\n\r\nGirl : \"Yes father.\"\r\n\r\nPriest : \"That's no reason to call him a son of a bitch.\"\r\n\r\nGirl : \"Then he stuck his you know what into my you know where.\"\r\n\r\nPriest : \"Like this?\" (as he stuck his you know what into her you know where)\r\n\r\nGirl : \"YES FATHER, YES FATHER, YES FATHER!!!\"\r\n\r\n(after a few minutes)\r\n\r\nPriest : \"That's no reason to call him a son of a bitch.\"\r\n\r\nGirl : \"But father, he had AIDS!\"\r\n\r\nPriest : \"THAT SON OF A BITCH!!!\""},
  {"content": "A man walks into a sandwich shop and looks at the menu board. It reads\r\n\r\nGrilled Cheese - $3 Ham and Cheese $5 Roast Beef - $6 Hand jobs -$20\r\n\r\nA beautiful blond with huge tits comes to the register and says \"what will you have handsome?\"\r\n\r\n\"Are you the one that gives the handjobs?\" He asks.\r\n\r\n\"Yes I am!.\" She replies with a wink.\r\n\r\n\"Well wash your fucking hands, I'll have a Grilled Cheese sandwich.\""},
  {"content": "A young boy is doing his science homework, and asks his dad for help.\r\n\r\n\"Dad, whats the difference between Theory, and Reality?\"\r\n\r\n\"Well,\" says the Dad. \"I'll tell you what. Go ask your sister if she would fuck the man who lives next door for $500,000.\"\r\n\r\nSo the son goes upstairs and returns a few minutes later and says to the Dad, \"She said she would.\"\r\n\r\n\"Ok son. Now go ask your mother the same thing.\"\r\n\r\nSo the son runs into the kitchen, and asks his mother. A minute later he returns and says \"She said she would too.\"\r\n\r\n\"Well then. In theory, we're sitting on $1,000,000 here. In reality, we live with a couple of whores.\""},
  {"content": "1st Daughter:\"Dad, I am a lesbian\"\r\n\r\nDad; \"Oh okay!\"\r\n\r\n2nd Daughter: \"I'm a lesbian too...\"\r\n\r\nDad: \"Jesus Christ, does any one in this family love dicks?\"\r\n\r\nSon: \"I do.\""},
  {"content": "A Woman goes to buy a Parrot. The prices are $100, $200, and $15. She asks why the last one is so cheap?\r\n\r\n\"Because he used to live in a brothel\" says the shopkeeper. She pays $15.\r\n\r\nWhen she gets home the parrot says: \"Fuck me, a new brothel!\" The woman laughs.\r\n\r\nWhen her daughters get home the parrot says: \"Fuck me, 2 new prozzies!\" The girls laughs too.\r\n\r\nWhen the dad gets home the parrot says: \"Fuck me Pete, haven't seen you for weeks!\""},
  {"content": "An 18 year old Italian girl tells her mom that she has missed her period for two months\r\n\r\nVery worried, the mother goes to the drugstore and buys a pregnancy kit. The test result shows that the girl is pregnant. Shouting, cursing, crying, the mother says, \"Who was the pig that did this to you? I want to know!\"\r\n\r\nThe girl picks up the phone and makes a call. Half an hour later, a Ferrari stops in front of their house. A mature and distinguished man with gray hair and impeccably dressed in an Armani suit steps out of the of the Ferrari and enters the house. He sits in the living room with the father, mother, and the girl and tells them: \"Good morning, your daughter has informed me of the problem. I can't marry her because of my personal family situation but I'll take charge.\"\r\n\r\n\"I will pay all costs and provide for your daughter for the rest of her life.\" \"Additionally, if a girl is born, I will bequeath a Ferrari, a beach house, two retail stores, a townhouse, a beachfront villa, and a $2,000,000 bank account. If a boy is born, my legacy will be a couple of factories and a $4,000,000 bank account. If twins, they will receive a factory and $2,000,000 each. However, if there is a miscarriage, what do you suggest I do?\"\r\n\r\nAt this point, the father, who had remained silent, places a hand firmly on the man's shoulder and tells him, \"You fuck her again.\""}
]