[
  {"content": "Donald Trump and Barack Obama end up in the same barbershop \r\n\r\nAs they sat there, each being worked on by a different barber, not a word was spoken. \r\n\r\nThe barbers were even afraid to start a conversation, for fear that it would turn into politics. \r\n\r\nAs the barbers finished their shaves, the one who had Trump in his chair reached for the aftershave. \r\n\r\nTrump was quick to stop him saying \"No way buddy, my wife will smell that and think I've been in a damn whorehouse.\" \r\n\r\nThe second barber turned to Obama and said \"How about you?\" Obama replied,\"\r\n\r\nGo ahead, my wife doesn't know what the inside of a whorehouse smells like."},
  {"content": "The trump family is flying from New York to DC\r\n\r\nDonald looks down on the cities below and says \"I think I'll throw a 1000$ bill out of the window and make some american happy. \r\n\r\nMelanie says \"Oh honey why not throw 10 100$ bills and make 10 americans happy?\" So then Ivanka says \"Even better daddy, throw 100 ten dollar bills out of the window and make 100 americans happy?\" \r\n\r\nTo that the pilot says \" Why dont you all jump out the window and make the whole country happy?\""},
  {"content": "Bill Clinton likes to go for a walk every Saturday evening.\r\n\r\nOne evening, he passed by an alley, and a prostitute yelled at him, \"Fifty dollars will buy you a good time!\"\r\n\r\nHe responded by saying \"How's about 5 dollars?\", jokingly, and kept walking.\r\n\r\nThis same thing kept happening every Saturday for a couple weeks; every time Bill passed the prostitute, she would offer him her services for fifty dollars, and he would decline and say he'd only pay five. \r\n\r\nOne evening, however, Hillary asked if she could come along on the walk with him, and Bill reluctantly agreed, nervous about what Hillary would say if the prostitute yelled at him again. They went on the walk, and when they passed the alley, to Bill's surprise, the prostitute was silent, and they continued on their walk. As they were about to round the corner, however, they heard the prostitute's voice from behind them,\r\n\r\n\"So that's what five dollars gets you, huh?\""},
  {"content": "Donald Trump, a Black man and a Jew are sitting in a hospital\r\n\r\ntheir wives all gave birth to healthy babies around the same time and are now resting. The three men are sitting in a room nearby when a nurse comes in and tells them there has been a mix-up, a nurse forgot to put identifying bracelets on the babies before taking them for a medical exam and now they don't know which baby is which.\r\n\r\nShe asks them if they could help identify their babies and the Jew goes first. One minute later, he steps out of the nursery holding a black baby, the Black man gets up and says ''Hey man, I'm pretty sure that one's mine'' to which the Jew replies ''One of those babies is a Trump, and I'm not taking any chances!''"},
  {"content": "Trump, Putin and Merkel take a nice walk along the shore. \r\n\r\nPutin is boasting: \"Russia now has submarine that can stay underwater for two weeks without needing to resurface for fuel! Pretty impressive, eh?\"\r\n\r\nTrump obviously can't leave it at that, so he tells Putin: \"America has submarines, and other stuff too, I'm telling you, lots of stuff, and it's great stuff, and our submarines can stay underwater, and also, they don't need to come back up to the surface or resurface, for two months, because I made them great again!\"\r\n\r\nMerkel is just about to change the topic to export politics when suddenly a submarine resurfaces next to the three, the hatch opens and a man salutes out of it: \"Heil Hitler! We need Diesel.\""},
  {"content": "Hillary's mad at Satan\r\n\r\nHillary: Satan! We had a deal! Where's the election victory that you promised me?\r\n\r\nSatan: Where's the soul that you said you had?"},
  {"content": "Donald Trump has been kidnapped by terrorists!\r\n\r\nI heard it on the radio while I was driving down the freeway on my way to work. But then I was stuck in traffic.\r\n\r\nSome guys came up to my car, knocked on my window and said \"Sir, as you must have heard, Donald Trump has been kidnapped by terrorists! They have demanded a 50 Billion dollar ransom, or else they will douse him in gasoline and burn him alive! We are going car to car asking for a contribution.\"\r\n\r\n\"Oh Dear!\" I exclaimed. \"What is the average contribution people are giving to this great and noble cause?\"\r\n\r\n\"About a gallon, sir\""},
  {"content": "One day in the future, Donald Trump has a heart-attack and dies.\r\n\r\nHe immediately goes to Hell, where the devil is waiting for him. \"I don't know what to do here,\" says the devil.\" You're on my list, but I have no room for you.\r\n\r\nYou definitely have to stay here, so I'll tell you what I'm going to do. I've got three folks here who weren't quite as bad as you.\r\n\r\nI'll let one of them go, but you have to take their place. I'll even let YOU decide who leaves.\"\r\n\r\nDonald thought that sounded pretty good, so the devil opened the door to the first room.\r\n\r\nIn it was Barack Obama and a large pool of water. Barack kept diving in, and surfacing, empty handed. Over, and over he dived in and surfaced with nothing. Such was his fate in hell.\r\n\r\n\"No,\" Donald said. \"I don't think so. I'm not a good swimmer and it would ruin my hair. I don't think I could do that all day long.\"\r\n\r\nThe devil led him to the door of the next room. In it was Al Gore with a sledge-hammer and a room full of rocks. All he did was swing that hammer, time after time after time. \"No, this is no good; I've got his problem with my shoulder. I would be in constant agony if all I could do was break rocks all day,\" commented Donald.\r\n\r\nThe devil opened a third door. Through it, Donald saw Bill Clinton, lying on the bed, his arms tied over his head and his legs restrained in a spread-eagle pose. Bent over him was Monica Lewinsky, doing what she does best.\r\n\r\nDonald looked at this in shocked disbelief, and finally said, \"Yeah man, I can handle this.\"\r\n\r\nThe devil smiled and said..........\r\n\r\n\"OK, Monica, you're free to go.\""},
  {"content": "Obama, Queen Elizabeth and Vladimir Putin all died and, as former world leaders, were being given a tour of hell\r\n\r\nWhile there, they saw a red phone and asked what the phone is for. The devil tells them it is for calling back to Earth.\r\n\r\nPutin asks to call Russia and talks for 5 minutes. When he is finished the devil informs him that the cost is a million dollars, so Putin writes him a check.\r\n\r\nNext Queen Elizabeth calls England and talks for 30 minutes. When she is finished the devil informs her that the cost is 6 million dollars, so she writes him a check.\r\n\r\nFinally Obama gets his turn and talks for 4 hours. When he is finished the devil informs him that the cost is $5.00.\r\n\r\nWhen Putin hears this he goes ballistic and asks the devil why Obama got to call USA so cheaply. The devil smiled and replied: \"Since Trump took over, the country has gone to hell, so it's a local call.\""},
  {"content": "A lone sniper was just about to assassinate Donald Trump.\r\n\r\nJust at the last moment, one of the President's bodyguards spotted him. \r\n\r\nHe immediately shouted \"Mickey Mouse, Mickey Mouse\" A shot rang out and Trump fell dead. As his aides gathered round the body, one of them asked the bodyguard why he had shouted \"Mickey Mouse\" 'I'm sorry\" he said \"I meant to shout \"Donald, duck\""},
  {"content": "Donald Trump goes to a fortune teller and asks \"When am I going to die?\"\r\n\r\nThe fortune teller replies: \"you will die on a major Mexican holiday.\"\r\n\r\nTrump asks: \"Which Mexican holiday? Cinco de Mayo? Dia de los muertos?\"\r\n\r\nThe fortune teller replies: \"ANY day you die, Donald, will be a major Mexican holiday!\""},
  {"content": "What's the difference between Trump becoming president and a soldier dying in combat?\r\n\r\nThe soldier knew what he signed up for.\r\n"},
  {"content": "In breaking news, Triple Crown winner Justify has turned down an invitation to White House.\r\n\r\nWhen asked why he answered, “If I wanted to see a horse’s ass, I would have finished second.”"},
  {"content": "Trump, Obama, Clinton, and Bush decided to have a sprinting race\r\n\r\nTrump, Obama, Clinton, and Bush decided to have a sprinting race to see who's the fastest\r\n\r\nTrump went first and he ran from the start to the finish line in 23:34 minutes\r\n\r\nClinton went second and got 15:28 minutes\r\n\r\nObama went after and did 10 minutes, thinking he may have won, Obama is fairly optimistic\r\n\r\nUntil Bush did 9:11"},
  {"content": "On the night of his inauguration, Donald Trump is visited by 3 ghosts\r\n\r\nEarly in the night, FDR appears. Trump asks him \"how can I make America great again?\" FDR replies \"think only of the people; do not make laws based on hatred, bigotry, or with the thought of lining your own pockets\" Trump's face sours \"FAKE NEWS!\" he screams and FDR disappears. Trump falls back to sleep.\r\n\r\nA few hours later, he is awakened by George Washington's ghost. Trump asks \"how can I make America great again?\" Washington replies \"I would suggest you never tell a lie\", which infuriates Trump. He screams for his bodyguards but Washington is already gone.\r\n\r\nAround 3 in the morning, he is visited by the ghost of Abraham Lincoln. Again, he asks \"how can I make America great again?\". Lincoln thinks for a bit and says \"go to the theater\"."},
  {"content": "Pakistan president calls to Obama in the morning\r\n\r\nAnd says \"I'm sorry to hear about the terrorist attacks in New York, I wanted to be the first one to call and show my support to America\"\r\n\r\nAfter a pause Obama replies \"What attack? I have no news of such attacks yet\"\r\n\r\nA dramatic silence prevails\r\n\r\nAfter a while Obama hears a voice on phone that sounded like someone shouting \"shit I forgot about the time difference\"."},
  {"content": "Barack Obama walks into a bar, but he is invisible.\r\n\r\nThe bartender says \"Ok, I'll bite. Why are you invisible?\"\r\n\r\nBarack says \"Well, I found a bottle on the beach and...then I rubbed it.\" \"And then...importantly...A genie came out.\" \"The genie said I could have...3 wishes.\"\r\n\r\nFor my first wish, I said \"Let me say this, and this is profoundly important...I want Michelle to marry me...I love her,...and I think America will love her too.\" That wish was granted.\r\n\r\nFor my second wish, I said \"Like all patriotic Americans, I am deeply patriotic...and I want to be President...of the United States...so I can serve my country.\" That wish was granted too.\r\n\r\nAnd then, for my third wish, I started by saying \"Let me be clear...\""}
]